app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"
---
  def home
    @posts = Post.all

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "auriga"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 2)
---
  def profile
    if (User.find_by_username(params[:id]))
      @username = params[:id]
    else
        redirect_to root_path, :notice=> "User not found!"
  end

  @posts = Post.all.where("user_id = ?",User.find_by_username(params[:id]).id)

SELECT "posts".* FROM "posts"
---
  def explore
   @posts = Post.all